In [2]:
import pandas as pd
from matplotlib import pyplot as plt
import plotly.express as px
import numpy as np
from sklearn.decomposition import PCA
from sklearn.manifold import TSNE

%matplotlib inline

In [29]:
# Reading data
df_enrollment = pd.read_csv('../../data/csv/enrollment.csv')
df_student = pd.read_csv('../../data/csv/student.csv')
df_courses = pd.read_csv('../../data/csv/courses.csv')
df_student.head()

,Unnamed: 0,student_name,section,student_id
0,0,Aabid Fouad,Génie mécanique,0
1,1,Aamodt Simen,Génie mécanique,1
2,2,Aanhaanen Simone,Architecture,2
3,3,Aapro Laurent,Systèmes de communication - master,3
4,4,Aapro Niccolò,Informatique,4

In [9]:
df_enrollment.head()

   Unnamed: 0  student_id  course_id           semester
0           0        3692          0  Master semestre 2
1           1       34913          0  Master semestre 2
2           2        4980          1  Master semestre 4
3           3       17942          1  Master semestre 4
4           4       23904          1  Master semestre 4

In [41]:
df_courses.head()

   Unnamed: 0  course_id                             course_name       year
0           0          0  Biological and physiological transport  2006-2007
1           1          1  Biological and physiological transport  2007-2008
2           2          2       Special topics in reactor physics  2015-2016
3           3          3       Special topics in reactor physics  2014-2015
4           4          4       Special topics in reactor physics  2013-2014

# Filtering master courses

In [45]:
df_master = df_enrollment.copy()
df_master['level'] = df_master['semester'].apply(lambda x: x.split()[0])
df_master.head()

   Unnamed: 0  student_id  course_id           semester   level
0           0        3692          0  Master semestre 2  Master
1           1       34913          0  Master semestre 2  Master
2           2        4980          1  Master semestre 4  Master
3           3       17942          1  Master semestre 4  Master
4           4       23904          1  Master semestre 4  Master

In [66]:
df_tmp = df_master.merge(df_student, on='student_id').groupby(['course_id', 'level']).count()\
    .sort_values(by='semester', ascending=False).reset_index()[['course_id', 'level']]
df_tmp = df_tmp.drop_duplicates(subset='course_id')
master_courses_id = set(df_tmp[df_tmp['level'] == 'Master']['course_id'])
len(master_courses_id)

9111

In [92]:
df_enrollment['mask'] = df_enrollment['course_id'].apply(lambda x: x in master_courses_id)
df_enrollment = df_enrollment[df_enrollment['mask']]
df_enrollment = df_enrollment.drop(axis=1, labels=['Unnamed: 0', 'mask'])

df_courses['mask'] = df_courses['course_id'].apply(lambda x: x in master_courses_id)
df_courses = df_courses[df_courses['mask']]
df_courses = df_courses.drop(axis=1, labels=['Unnamed: 0','mask'])

In [90]:
df_enrollment.head()

   student_id  course_id           semester  mask
0        3692          0  Master semestre 2  True
1       34913          0  Master semestre 2  True
2        4980          1  Master semestre 4  True
3       17942          1  Master semestre 4  True
4       23904          1  Master semestre 4  True

In [78]:
df_enrollment.to_csv('../../data/csv/server/enrollment.csv')
df_courses.to_csv('../../data/csv/server/courses.csv')

# Keeping only recent students

We will keep only the most recent students: from the a.y. 2013-2014 until 2019-2020.

In [79]:
df_filtered = df_course.merge(df_enrollment, on='course_id')
df_filtered = df_filtered[df_filtered['year'] > "2012-2013"]
set(df_filtered.year)

{'2013-2014',
 '2014-2015',
 '2015-2016',
 '2016-2017',
 '2017-2018',
 '2018-2019',
 '2019-2020'}

In [28]:
students = list(set(df_filtered.merge(df_student, on='student_id').student_name))

In [84]:
%store students >../../data/students.txt

Writing 'students' (list) to file '../../data/students.txt'.